onec-mid-base-11/src/Documents/ИЗМ_Доставка/ИЗМ_Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИЗМ_Доставка</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ИЗМ_Доставка/ObjectModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ЗначениеРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Договор,  
		|Комментарий,
		|Контрагент,
		|Ссылка,
		|Организация,
		|Ответственный,
		|Товары");
		ТаблицаТовары = ЗначениеРеквизитов.Товары.Выгрузить();
		// Заполнение шапки
		Договор = ЗначениеРеквизитов.Договор;
		Комментарий = ЗначениеРеквизитов.Комментарий;
		Контрагент = ЗначениеРеквизитов.Контрагент;
		Организация = ЗначениеРеквизитов.Организация;
		Основание = ЗначениеРеквизитов.Ссылка;
		Ответственный = ЗначениеРеквизитов.Ответственный;
		//Заполнение Табличной части
		Для Каждого Строка Из ТаблицаТовары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = Строка.Количество;
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
		КонецЦикла;  
		
	КонецЕсли;
	
КонецПроцедуры

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
